
#### 程序结构
C 程序由下列部分组成：

* 正文段 —— CPU 执行的机器指令部分；一个程序只有一个副本；只读，防止程序由于意外事故而修改自身指令
* 初始化数据段（数据段）—— 在程序中所有赋了初值的全局变量，存放在这里。   
* 非初始化数据段（bss段）—— 在程序中没有初始化的全局变量；内核将此段初始化为0。    
* 栈 —— 增长方向：自顶向下增长；自动变量以及每次函数调用时所需要保存的信息（返回地址；环境信息）
* 堆 —— 动态存储分。

#### 变量类型
变量可以分为：全局变量、静态全局变量、静态局部变量和局部变量

按存储区域分，全局变量、静态全局变量和静态局部变量都存放在内存的静态存储区域，局部变量存放在内存的栈区。

按作用域分，全局变量在整个工程文件内都有效；静态全局变量只在定义它的文件内有效；静态局部变量只在定义它的函数内有效，只是程序仅分配一次内存，函数返回后，该变量不会消失；局部变量在定义它的函数内有效，但是函数返回后失效。


#### 静态全局变量
在全局变量之前加上关键字 static，全局变量就被定义成为一个静态全局变量。

1. 内存中的位置：静态存储区（静态存储区在整个程序运行期间都存在）
2. 初始化：未经初始化的静态变全局量会被程序自动初始化为0（自动对象的值是任意的，除非他被显示初始化）
3. 作用域：静态全局变量在声明他的文件之外是不可见的。准确地讲从定义之处开始到文件结尾。


定义静态全局变量的好处：

1. 不会被其他文件所访问，修改，降低模块间的耦合度
2. 其他文件中可以使用相同名字的变量，不会发生冲突。


#### 静态局部变量
在局部变量之前加上关键字 static，局部变量就被定义成为一个静态局部变量。

1. 内存中的位置：静态存储区
2. 初始化：未经初始化的静态局部变量会被系统初始化为0
3. 作用域：作用域仍为局部作用域，当定义它的函数或者语句块结束的时候，作用域随之结束。 

 注：当 static 用来修饰局部变量的时候，它就改变了局部变量的存储位置，从原来的栈中存放改为静态存储区。但是静态局部变量在离开作用域之后，并没有被销毁，而是仍然驻留在内存当中，直到程序结束，只不过我们不能再对他进行访问。当 static 用来修饰全局变量的时候，它就改变了全局变量的作用域（在声明他的文件之外是不可见的），但是没有改变它的存放位置，还是在静态存储区中。

#### 静态函数
在函数的返回类型前加上关键字static，函数就被定义成为静态函数，也称内部函数。

static 函数类型 函数名(函数参数表)
{……}

函数的定义和声明默认情况下是 extern 的，但静态函数只是在声明他的文件当中可见，不能被其他文件所用。

定义静态函数的好处：

1. 其他文件中可以定义相同名字的函数，不会发生冲突
2. 静态函数不能被其他文件所用。

存储说明符 auto，register，extern，static，对应两种存储期：自动存储期和静态存储期。auto 和 register 对应自动存储期，具有自动存储期的变量在进入声明该变量的程序块时被建立，它在该程序块活动时存在，退出该程序块时撤销。关键字 extern 和 static 用来说明具有静态存储期的变量和函数。用 static 声明的局部变量具有静态存储持续期（static storage duration），或静态范围（static extent）。虽然他的值在函数调用之间保持有效，但是其名字的可视性仍限制在其局部域内。静态局部对象在程序执行到该对象的声明处时被首次初始化。

#### 外部函数

外部函数的定义：在定义函数时，如果没有加关键字“static”，或冠以关键字“extern”，表示此函数是外部函数：

[extern] 函数类型 函数名(函数参数表)
{……}

调用外部函数时，需要对其进行说明：

[extern] 函数类型 函数名(参数类型表)[，函数名2(参数类型表2)……]；

static 函数与普通函数作用域不同。仅在本文件。只在当前源文件中使用的函数应该说明为内部函数(static)，内部函数应该在当前源文件中说明和定义。
对于可在当前源文件以外使用的函数，应该在一个头文件中说明，要使用这些函数的源文件要包含这个头文件。


#### 区别

static 全局变量与普通的全局变量：static 全局变量只初使化一次，防止在其他文件单元中被引用

static 局部变量和普通局部变量：static 局部变量只被初始化一次，下一次依据上一次结果值

static 函数与普通函数：static 函数在内存中只有一份，普通函数在每个被调用中维持一份拷贝

全局变量和静态变量如果没有手工初始化，则由编译器初始化为0。局部变量的值不可知。
